BusinessProcesses/ЗаявкаНаПубликацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаНаПубликацию</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликацияСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ВидКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пуш</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСокет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/ЗаявкаНаПубликацию/Ext/ObjectModule.bsl
Процедура ДоступПредоставленПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПубликацияСогласована;
КонецПроцедуры

Процедура ОтправитьОповещениеСогласующемуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	Текст = СтрШаблон("Новое согласование публикации %1 для %2", Задача.БизнесПроцесс.Секрет, Задача.БизнесПроцесс.Пользователь);
	ОповещенияПереопределяемый.ОповеститьПользователя(Исполнитель, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура ДобавитьДоступПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Выполняется в кользовательском контексте для расшифрока сообщения
КонецПроцедуры

Процедура ОтправитьОповещениеОРезультатеСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Текст = СтрШаблон("По вашей заявку на публикацию %1 результат: %2", Задача.БизнесПроцесс.Секрет, "Отклонено");
	ОповещенияПереопределяемый.ОповеститьПользователя(Задача.БизнесПроцесс.Пользователь, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура СогласоватьДоступОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
КонецПроцедуры

Процедура ОправитьОповещениеАдминистраторуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	Текст = СтрШаблон("Пользователь %2 завершил публикацию секрета %1 в OpenBao", Задача.БизнесПроцесс.Секрет, Задача.БизнесПроцесс.Пользователь);
	ОповещенияПереопределяемый.ОповеститьПользователя(Исполнитель, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры
